用户画像
***********

本项目的用户包括 ``普通用户``, ``普通工程人员`` ,``开发人员`` 及 ``课程教授``。
本小节将对每一种用户分别讨论用户:

1. 特点 
2. 诉求
3. 会与系统的何部分产生交互
4. 需求提交方法

普通用户
++++++++++++++

普通用户是本软件的最终使用者。普通用户没有任何EE&CS专业知识背景, 仅仅能够与手机和计算机进行基本的交互
(例如填写并提交表单, 通过GUI访问程序页面等)。普通用户主要关注: 

1. 系统易于使用, 易于配置
2. 系统出错率低（或是系统出错后可以在不被察觉的情况下修复)

普通用户会和系统的终端产生交互。系统的全部在用户眼中只是手机或电脑上的GUI程序。

由于用户的特点, 普通用户仅能够使用模糊的自然语言描述理想中的系统该如何工作。我们需要通过访谈或是问卷的方式, 
获取普通用户的需求数据, 并对这些数据进行整理与建模，然后记录为标准化用例。

在本项目的开发中, 会让文档撰写人员扮演普通用户的角色，然后自问自答。

普通工程人员
++++++++++++++

普通工程人员是在软件分销商或系统集成商的工作人员。根据经验来看, 中小型城市的工程人员, 并不总具有EE&CS专业背景知识; 
相对普通用户, 他们能够付出更多的时间来学习系统的使用与配置, 他们接受使用更难于使用的接口以提高工作效率。这类用户主要关注:

1. 操作文档是否完善
2. 开发团队是否有完善的错误管理机制及错误修复的速度
3. 用于管理系统的接口效率是否足够高
4. 系统的部署过程是否足够简单

普通工程人员的需求是具有明确的目标导向的, 他们会使用严谨的自然语言描述自己的需求。我们可以通过访谈或是问卷的方式, 获取
普通工程人员的需求数据, 然后在确保可实现性的情况下对信息稍作加工整理, 记录为标准化用例。

在本项目的开发中，会让不参与编码工作的团队成员充当普通工程人员的角色尝试为假想的用户部署本系统, 提出新的需求并直接记录为标准化用例。

开发人员
++++++++++++++

开发人员是开发团队之外，有兴趣为项目贡献代码或是想要修改该系统以适应额外需求的人员。开发人员拥有专业知识背景，且具有完全理解系统
工作原理的能力。开发人员主要关注:

1. 测试代码是否完善
2. 系统的架构是否合理
3. API文档是否完善
4. 代码质量

开发人员的需求将由开发团队本身, 在进行项目开发的过程种进行整理与记录。

课程教授 
++++++++++++++

课程教授是特殊的用户, 是本项目名义上的委托人(甲方)。课程教授将主要关注

1. 开发进度是否满足要求
2. 文档完善程度
3. 功能的完成度
4. 开发团队的管理与组织

课程教授的需求将通过开发任务说明的相关文档来获取。由于课程教授的需求已经被合理的组织且记录在了《软件工程-嵌入式方向-大作业考核说明》这一文档中,
因此, 本文档将不讨论这一特殊用户的需求。
